{"/blog/":{"data":{"":" RSS Feed "},"title":"Blog"},"/blog/12th-fail/":{"data":{"":" It is not your typical underdog story where the protagonist goes from poverty to prosperity. 12th fail is an inspiring take on hope, determination, honesty and failure. Contrary to many other bollywood biographies, lack of a traditional villain in this story is a bold move. This made it all the more intriguing.\nMoreover VVC captures the universal struggle of truth and empathy, creating a narrative that resonates deeply with the audience and effortlessly brings tears to the surface.\nVikrant Massey’s performance in this film is nothing short of extraordinary. His role as Manoj is deserving of a National Award. The supporting cast were equally remarkable in their roles that contributed to the film’s excellence. What stood out to me most was the beautiful score composed by Shantanu Moitra, which served as the soulful essence of the film. It added more depth to the narrative and made it a good cinematic experience.\nIn its entirety, ‘12th Fail’ emerges as a thought-provoking masterpiece. Beyond mere entertainment, it is inspiring. It is one of those films that one can revisit for a much-needed restart during moments of demotivation."},"title":"12th Fail"},"/blog/70-hours-per-week/":{"data":{"":"Infosys founder Narayana Murthy recently said that, young Indians must work 70 hours a week. – a phenomenal recommendation from a prominent capitalist. I respect his achievements but a statement like this makes me want to question his intelligence or, take any of these wise old men seriously. His idea is if you want India to realize its economic potential every young Indian must say: “This is my country. I want to work 70 hours a week.” 1\nWell, you do not need to work 70 hours to realize its economic potential.2 Maybe he forgot the part where the quality of life also plays a crucial part in economic development? Maybe higher wages would help? I don’t know, I am no expert. Nonetheless for the sake of argument, let’s explore the numbers.\nAssuming a five-day work week, and subtracting 70 hours for work leaves out 50 hours.\nIf we allocate a bare minimum portion for essential activities like sleeping (averaging 8 hours a day) and meals (1.5 hours a day for three meals), we are left with barely a dozen hours.\nI have not included commuting, grooming or leisure time for that matter. it’s crucial to acknowledge that quality of life plays a significant role in economic development, which Murthy happily chose to ignore in his statement. Merely advocating for longer work hours without addressing other factors undermines overall well-being.\nOh, and the nationalist angle is ridiculous. for the sake of India, you cannot work 14 hours a day? Oh come on?! Where’s all the energy draining? Don’t you tell me you are working two jobs?? Oh right, that’s called moonlighting. Don’t do that, that’s unethical! You can only slog for us, because we are a big company and you are our modern slave.\nhttps://www.businessinsider.in/policy/economy/news/billionaire-businessman-says-young-indians-should-work-70-hours-a-week/articleshow/104787562.cms ↩︎\nhttps://www.investopedia.com/ask/answers/032415/what-are-some-ways-economic-growth-can-be-achieved.asp ↩︎"},"title":"70 Hours per Week"},"/blog/apple-vision-pro/":{"data":{"":" Have you ever had of something called a Bad Apple? Well you might be amazed to hear that all the normies have assembled together again to admire a new addition to their walled-garden, The all new VR Headset, or as apple likes to call it their first “spatial computer”\nThis device is supposed to be put on your head so that you seamlessly switch between the physical and digital world. The best part about it is you can take it out after two minutes, because it is such a headache to have it on. If you don’t believe me, try putting a 500 gram object on your head - which will be lighter than this headset. it is just too unnecessary. they really expect people to keep wearing this like a bunch of zombies; And whenever they feel like activating their digital world, it is a button away, all of which is controlled by (you guessed it) apple!\nWatch Full Video What you cannot control though are apple’s innovative decisions. Rightfully so, they want their customers to have the best experience, and you trust them, right? Well then, you just need to pinch yourself, because what you are having is a dream.\nthis new piece of tech is ridiculously priced, and isn’t worth the price. As the apple joke goes, one has to sell a kidney to buy their one product. But with Apple Vision Pro, you would most likely have to sell both."},"title":"Apple Vision Pro is Trash"},"/blog/archiving-files-using-tar/":{"data":{"":"I like archiving files and directories, mostly due to local storage constraints. Creating backups of files and saving them in tarballs or 7zips has become second nature to me. However I have realized I have been doing it wrong all along. I’ve predominantly relied on GUI methods, only to discover that the command line method is so straightforward that even a caveman could do it.\nThis is a short note for me, and for you in case you would want to compress or extract archived files using the command line.\nCreating a Tar Ball tar -cvf project.tar /path/to/files # does not compress Compressing a Directory tar -czvf project.tar.gz /path/to/files Extracting All Files tar -xf project.tar Listing Contents in Tar File tar -tvf project.tar.gz Finding Specific File in Tar File tar -tvf project.tar.gz \"path/to/file\" Extracting One file from Tar tar -zxvf project.tar.gz \"/path/to/file\" OPTIONS:\n–c create an archive –f specify file –t list contents without extracting archive –v verbose; displays progress in the terminal –x extracts files –z compress with gzip "},"title":"Archiving Files Using Tar"},"/blog/bangalore-weather/":{"data":{"":" Bengaluru is like a dear friend who gets along really well with anyone. She’s known for her pleasant nature, creative mind, love for greens and hanging out with people of diverse backgrounds. As someone who has lived with Bengaluru, like many of us, who deeply value the essence of her character, I would reject the idea if someone told me our beloved city could a face water crisis or reach a scorching high temperature of 37 degrees this summer. (again)\nAfter all, we love her as we have seen her – Grow as a quaint garden city to a beautiful bustling metropolis. A city crowded by cars and cafes, ignoring the effects of climate change and urbanization. And now our dear friend is weary. While her heart beats with a passion for technology and innovation, she longs for a break from endless development.\nTo ensure her sustainability for years to come, let us recognize her need to prioritize self-care. Here are a few simple things you can do to nurture your friendsip with Bengaluru.\nConserve water by fixing leaks, taking shorter showers, turning off taps when not in use, and using water wisely. Turn off lights, fans, and electronic devices when not in use to conserve energy and lower utility bills. Advocate for increased tree planting initiatives, and protest against cutting down trees for corporate profit. Practice proper waste management by segregating waste at the source into recyclables and non-recyclables. Opt for public transport whenever possible to alleviate carbon emissions and traffic congestion. Spread awareness about environmental issues and the importance of sustainability through social media and other mediums. "},"title":"Bangalore Weather is Changing"},"/blog/best-films-2023/":{"data":{"":"these are my favorite films of 2023. of course, there are better films i have missed. do let me know if any.","englishforeign#English/Foreign":" Barbenheimer Two films that are a phenomenon in itself - Greta Gerwig’s hysterical comedy and Nolan’s Atomic Bomb. My favorites this year.\nKillers Of The Flower Moon An epic about Osage killings. Killers Of The Flower Moon is a good Western with fine storytelling; the kind you expect from a Scorcese film.\nPast Lives Past lives takes a very nuanced approach to the what-ifs. it is praiseworthy for its spectacular dialogue and emotional story.\nThe Killer Michael Fassbender, “the Killer” assassin on a killing spree after a hit goes wrong. Yikes, truly worth a watch!\nAre you there God? It’s me, Margaret. A coming-of-age drama which I did not expect I would like. It’s a simple story of a young girl and the challenges she faces in her adolescence.\nSuzume A beautiful world of Shinkai through a fantastical adventure of Suzume, helping a mysterious man close doors that is causing disasters in Japan.\nA Haunting in Venice Yet another Poirot story you just cannot get enough of.\nAnatomy Of A Fall A courtroom drama about a writer trying to prove her innocence in her husband’s death.\nBlackberry honestly after watching this film, it just makes you want to turn back time.. and own a blackberry.\nMission Impossible: Dead Reckoning Part One Imagine an omnipotent A.I taking over the world? Well, this movie could potentially be the trailer of what’s to happen irl.\nKnock At the Cabin Knock, Knock, who’s there? A prophecy, delivered by four individuals who claim the fate of the world hinges on sacrificing a family member.\nIndian films – This year was the year of commercial cinema\n12th Fail An extraordinary take on the real-life story of Manoj Kumar Sharma, who overcame extreme poverty to become an Indian Police Service officer. It’s my favorite Indian film this year.\nSirf Ek Banda Kaafi Hai Another courtroom drama I liked with a delicate subject starring Bajpayee, who time and again proves, ki ek acchi film ke liye sirf ek banda kaafi hai.\nPathaan \u0026 Jawan Let’s just say Pathaan is an event film, while Jawan is a longing for Shah Rukh Khan to be back on screen again. Purely commercial entertainers!\nAnimal Is the hype real? Well, from a technical standpoint it is good, it is bold \u0026 unlike any other Indian film you will see.\nMaamannan A politically charged drama with beautiful imagery and unique metaphors.\nJailer \u0026 Leo Big commercial stars with over-the-top action set-pieces.\nPonniyin Selvan - Part II PS-2 fares well in terms of filmmaking in comparsion to the first part.\n2018 \u0026 Kannur Squad Both stories have a common theme of taking charge as a leader, working with a team and driven by human emotions."},"title":"Best Films - 2023"},"/blog/configparser/":{"data":{"":"","#":"Introduction configparser 1 is a module that provides functionality for working with config files in a standardized format.\nAlthough storing configurations in formats like JSON, Yaml/Toml, environment variables or a database exists, configparser stands out to me as a pythonic approach, as it promotes simplicity and reduces dependencies.\nQuick Start Let’s take a very basic configuration file: [DEFAULT] ; this is a comment user_name = super-user passwd = secure-pass [DATABASE] host = localhost port = 5432 database = mydb [Logging] ; Logging configuration log_level = INFO log_file = /var/log/my_python_app.log creating the same file programatically # importing module import configparser config = configparser.ConfigParser() config['DEFAULT'] = { 'user_name' : 'super_user', 'passwd': 'secure-pass' } config['DATABASE'] = {} config['DATABASE']['host'] = 'localhost' config['DATABASE']['port'] = '5432' config['DATABASE']['database'] = 'mydb' config['LOGGING'] = { 'log_level': 'INFO', 'log_file': '/var/log/my_python_app.log' } with open('config.ini', 'w') as configfile: config.write(configfile) ℹ️ If you want to include a default section, you would typically add it to your configuration file explicitly. Accessing data Fetches sections, values. Note also that keys in sections are case-insensitive and stored in lowercase. import configparser config = configparser.ConfigParser() config.sections() config.read('config.ini') sections = config.sections() # ['DATABASE', LOGGING'] user_name = config.get('DEFAULT', 'user_name' ) # super-user password = config.get('DEFAULT', 'passwd' ) # secure-pass db_name = config['DATABASE']['database'] # mydb Config parsers do not guess datatypes of values in configuration files, always storing them internally as strings. This means that if you need other datatypes, you should convert on your own. port_number = config['DATABASE']['port'] # \u003cclass 'str'\u003e PORT = int(port_number) # 5432 print(type(PORT)) # \u003cclass 'int'\u003e https://docs.python.org/3/library/configparser.html ↩︎"},"title":"Parsing Configuration files in Python"},"/blog/custom-domain/":{"data":{"":"","step-1#Step 1":"","step-2#Step 2":"","step-3#Step 3":"","step-4#Step 4":"","step-5#Step 5":"There are far more problems in the world than setting up a custom domain. it’s ridiculous how a simple thing is made so complicated that any new user would break their head trying to make it work.\nin this blog, i will share how to set up a custom domain using github pages.\ni already had github pages1 set up, and i bought a domain from hostinger. if you haven’t purchased a domain, you can get it here, and if you are lazy to create a static page on your own, you can use one of these templates.\nStep 1 Deploying your page to github.\nif you need help, you can refer the docs. it’s pretty straight-forward. Step 2 Sign in to your domain.\nGo to your domain’s home page. for hostinger domains go to: hpanel Under domains, choose the domain you want to set the custom domain to by clicking on “Manage” On the left panel, click on “DNS/Nameservers” to configure the CNAME and A records. Step 3 Now this is the tricky part where most of the misconfiguration happens.\nIf you find any existing “CNAME” records or “A records”, delete them Step 4 Adding CNAME and A records\nCNAME – There must be 2 CNAME records, and both records must point to ‘your-github-username.github.io’\nFirst CNAME record must have ‘www’ Second CNAME record must be left blank After saving both CNAME records, the result should look like this.\nA Records – There are 4 github IPs we need to add to our A records, and they are as follows: 185.199.108.153\n185.199.109.153\n185.199.110.153\n185.199.111.153 After saving all the A records, the result should look like this.\nStep 5 Add the custom domain to your github.io page.\nHead to your GitHub repository and click on the Settings tab. Then, click on the Pages tab and enter your custom domain in the Custom Domain field –\u003e Hit Save Wait for 15 mins for the TLS cert to be generated. And just like that, you have set up your custom domain to GitHub Pages!\nhttps://pages.github.com/ ↩︎"},"title":"custom domain for github pages"},"/blog/django-structure/":{"data":{"":"","app-structure#App Structure":"","design#Design":"","project--app#Project \u0026amp; App":"","static#Static":"","templates#Templates":"I love the Python Programming Language, and its most popular Web Framework - Django. In fact I love it so much that it is reflected in my pseudonym. I am no expert django dev, however I understand the design. this blog post unravels the intricacies of Django’s structural design.\nDesign Django follows a Model-View-Template (MVT) architectural design pattern.\nModel: Defines the data structure of the application. Models are used to interact with the database.\nView: Handles user requests, processes data from the model, and renders templates.\nTemplate: Handles how data is displayed. Typically written in HTML with Django template language.\nProject \u0026 App Project: A Django project is the entire web application. App: A module within a project that performs a specific function. Typical Project Structure myproject manage.py myproject _init_.py settings.py urls.py wsgi.py static templates – manage.py: A command-line utility for interacting with the project, such as running development servers, creating database tables, creating superusers, making migrations, etc.\n– myproject/: Named after the core project. contains global urls, settings.\n– __init__.py - empty file that indicates that this directory should be treated as a Python Package.\n– settings.py: global configuration settings for the project, including database connections, static files, middleware, and more.\n– urls.py: Defines the URL patterns for the project.\n– wsgi.py: configuration for the WSGI server, which is responsible for serving the web application.\n– asgi.py: similar to WSGI, but it performs some additional functions\nApp Structure myproject manage.py my app migrations init.py admin.py apps.py models.py tests.py views.py myproject ─ migrations/: propagating changes you make to your models\n─ admin.py: file used to display the admin panel, connect models to the panel and make changes to admin interface.\n─ apps.py: configures the Django app.\n─ models.py: To create models so that we can query data.\n─ tests.py: contains code for application testing.\n─ views.py: Python functions that takes http requests and returns http response.\nStatic– stores images, CSS, or JS files.\nTemplates– a HTML document or a Python string mark-up using the Django template language.","typical-project-structure#Typical Project Structure":""},"title":"Django Project Structure"},"/blog/dune-part-two/":{"data":{"":" 🚫 Spoiler Alert: reader discretion is advised for those who haven’t seen the film. SILENCE. * The Lisan al Gaib speaks *\nThere is so much to say about Dune: a sci-fi marvel that exceeds expectations. On my first viewing of Dune Part One, it lacked the spice. But months later after revisiting the film, I found myself pleasantly surprised by the depth of the story. This led me to watch Dune: Part Two on the big screen.\nAnd oh boy, Timothee has dune it again. I beleive he is one of the few actors in Hollywood that can pull off diverse roles like these. The transition from Wonka to Paul Atreides showcases his exceptional talent. Austin Butler’s performance as creepy bald Feyd deserves an applause, while Zendaya, Javier Bardem and Rebecca Fergusson further elevate the film with their compelling performances.\nFor the majority of Dune: Part Two, Paul Atreides a.k.a Muad’dib Usul has no interest in being a messiah figure and wanted to just help the people of Fremen take control of what is rightfully theirs: Arrakis. Chani valued him for this, but not for long. It was a disappointing blow after he officially declared himself as “The Madhi”, after drinking the Water Of Life. The way the plot has turned out, it is really fascinating to await the forthcoming development in these characters.\nDenis Villeneuve’s vision with the cinematic brilliance of Greig Fraser, makes way for rich dialogue (Jon Spaihts) and breathtaking cinematography. Do not miss this film.\n“May thy knife chip and shatter.” ~ Paul Atreides"},"title":"Dune: Part Two - A Review"},"/blog/empire-of-hell/":{"data":{"":"All the world’s a digital stage, and all the men and women merely scrollin’ – with no exits, their entrance is a screen – a portal to their unseen dreams. broken\nand broke. impulse and hope-less.\na double-edged sword. swallow whole\npleasure and pain. one man at their time\nplays many parts of ruin.\nHis acts being seven gigs of your intimate data.\nfirst phase of his playbook – lure you in.\nThen gather and sell, finally build networth\nand tell the world, “I created an empire of hell.”"},"title":"An Empire of Hell"},"/blog/fb-intercepts-web-traffic/":{"data":{"":"","#":"In a newly disclosed court document,1 it was revealed that Facebook launched a secretive initiative called GhostBusters in the late 2010s, which could intercept and decrypt the network traffic between people using Snapchat’s app and its servers.\nThis enabled them to maintain a competitive advantage over other platforms, primarily Snapchat, later followed with Youtube and Amazon.\nHow did they do this? In early 2010s, Facebook acquired Onavo, an Israeli-based VPN service and mobile data analytics company known for data compression technology. This innovative technology was used to mitigate high bandwidth usage due to the high mobile data costs at the time.\nAfter the acquision of this company, they integrated an advert on Facebook called “protect”, which redirected users to download Onavo. Once this was enabled, Facebook could easily track any application you use on your phone and gather insightful data.\nWhat now? If you use any meta products, which sadly is the case nowadays, try to isolate your environment. By isolating your browsing activities, you can better protect your personal information and reduce the likelihood of being tracked or targeted by malicious actors.\nhttps://techcrunch.com/2024/03/26/facebook-secret-project-snooped-snapchat-user-traffic/ ↩︎"},"title":"Facebook Intercepts Web Traffic"},"/blog/firstblog/":{"data":{"":"in the vast expanse of the internet, i have constructed a small place of my own – a webpage, with a philosophy of its own.\nso if you don’t know me, let me tell you, i like simple stuff. and strangely enough i chose not to make this site super responsive with a shit-load of javascript. oh yes, if you have not guessed it already, i used a static site generator for this page. to be precise, hugo. with a minimal theme under the hood and an elegant design, i am sure you might be really impressed by the responsiveness and the speed of my page.\nbut you might be wondering why a webpage? i am going to tell you even if you are not wondering though.\nin all honesty, i wanted to have a place of my own on the internet: to have the freedom to put whatever i want in one place, rather than scattering it all around social media accounts. i can share this one link with anyone and BOOM! access to everything i post. sounds kind of like linktree, which sounds like a great idea if you are lazy to make a simple html page. hehe.\ni also don’t like the idea of getting into social media again, so this would be my ideal place, where random people can find my site and admire the simplicity of it, and of course know me.\nso if you want to subscribe to my rss or would like to keep visiting my webpage, here are a few things i will write about\ncinema technology literature anything about life new stuff i learned linux philosophy sports (cricket, maybe) an endless list of links. i have been wanting to do this for about a year now and here we are! i like my hecking site and i hope you do too.\nif you find any issues with my site, you can submit it here or contact me"},"title":"first blog"},"/blog/gandhi/":{"data":{"":"","#":"In hindsight it might seem like we are not affected by history, however, for the most part we are. Take a currency note for instance. Did you ever reflect on the man behind the note? His truths, legacy, philosophy, or principles for that matter, that left an indelible mark on our history.\nToday, I want to share my review on Gandhi’s biography, “The Story Of My Experiments With Truth”. There are 5 parts in his book, and I will go over all the key learnings from the Mahatma himself.\nPart 1 - Early Life Gandhi was born in Porbandar to a devout Hindu family. His father, Karam Chand was an esteemed minister and his mother, Putlibai, a religious and an intelligent woman. It was from his mother Gandhi reveals, that shaped his spiritual beliefs in the years to come. He was married at the age of thirteen, a child marriage commonplace during the time that weighed heavily on his conscience. a bitter truth he remorsely conveys that cast a shadow on his understanding of personal freedom.\nThroughout the chapters of Part 1, Gandhi confesses his shy nature and the ingenious ways he overcame it. He was an introvert finding delight in books. While I was eagerly flipping through the pages, it was abundantly clear to me that Gandhi was exceptionally well-read. He devoured knowledge across diverse subjects. Religion, Vegetarianism, Philosophy, you name it. In the truest sense, he was honest unlike any other. It takes an honest man some grit to reveal to his readers his shortcomings. Our man does that throughout these pages. Starting with an incident in his school days, where he was (wait for it) accused of lying! He had skipped a gymnastics class to be a nurse to his sick father. He states that it was the last careless incident of his school days, however, not of his childhood days though.\nThere are moments in young Gandhi’s life filled with his share of regrets: first, of an incident where he secretly stole coppers from his servant’s pocket money to smoke cigarettes. Another of any ill-formed friendship; a friend whom his mother, elder brother and wife warned to stay away from. He reveals that the reason for being friends with his elder brother’s classmate was to “reform him”. Alas, his intent did not go as planned. Instead he was influenced by him to be a meat-eater. He conveys his regret on taking this path briefly, although I felt maybe it would make him physically stronger while fighting against the British later (hehe just kidding!).\nAfter his father’s demise, and completing of his matriculation, he was presented with an opportunity to study in England. It struck me that it was only a century ago when Gandhi set his sight on England, and his caste people were agitated for him moving abroad, entitling him as an outcast. This serves as a reminder of the fluid nature of societal perception. it is just a matter of time, like they say, for the perspective to evolve. So off goes the outcast, leaving his wife and his first born: To England.\nIn England at last, Gandhi shares his brief encounters with the cultural differences, immersing himself in studying law, learning how to be “an English Gentleman”, and exploring vegetarianism. a narrative that unfolded delightfully. One key thing in this part of the book that caught my intrigue was Gandhi’s habit of accounting. He tracked his expenses precisely and succeeded in exercising it with large amounts as well. This is one thing I feel we lack in the consumeristic culture we live in today.\nAlso, for my readers who work a corporate job, here is something that may or may not apply to you. The following lesson was given to Gandhi by a Mr. Mehta, verbatim the first lesson on European etiquette –\n‘Do not talk loudly, never address people “sir” whilst speaking to them, as we do in India; only servants and subordinates address theirs masters that way.’ In the context of working in a corporate job, it’s just bad practise to do that. if you are a fresh graduate, it should take you a while, but what I find madly preposterous is people with a work experience exceeding a culinary hen still address their senior management people as ‘sir\" even though they have asked them NOT to! (I can recall three instances as I write this when a senior manager asked people not to call him sir!)\nIt’s a mystery to me on what they achieve from the disrespect they give their senior management. If a person demands to be called sir, that’s another story. You can ruffle their feathers nonetheless. Why? Because calling someone sir* is awkward, and outdated to say the least. However, I digress.\n* on circumstance of a corporate job. the usage on other places is debatable, yet I feel it polite only when you do not know a person’s name for instance. (totally avoidable though!)\nPart 2 - Experience in Africa In the annals of history, Gandhi’s encounter with racism in South Africa remains a poignant chapter. In this section of the book, he shares his experience at length about being ejected out of his first-class passenger seat, his battle against color prejudice and racism, his Christian contacts whose support helped him deeply in his quest for finding God and spiritual enlightenment.\nTo acquire true knowledge, Gandhi says, one must have a guru. a mentor to mold one’s progress and self-growth. A result of which yields a moral standing and strength. He pays tribute to Raychandbhai, who taught him the importance of self-discipline and truthfulness to Gopal Krishna Gokhale’s influence that shaped his political activism. Additionally, he speaks of other notable figures namely Leo Tolstoy, whose prose had influenced his view of the world profoundly.\nSpeaking of, I think finding the right Guru is a challenge. While one may lack the knowledge in a particular field, another would be too occupied to fulfill their own responsibilities. I think of it as a good thing though. In today’s digital age, there is a wealth of information you can acquire on the internet. The goal should be in this long walk, a constant strive for self-improvement.\nAnother thing to note is that Gandhi’s prose is deeply personal. If you delve into his work, it is close to impossible to not be affected by it. I must say, our hero was without a question an imperfect man. Despite all of this, his truths continue to resonate within us, a testament to his enduring power of prose.\nHis influence is far-fetched akin to the arms of a bapu, literally. In Africa, He unites all the Indians under a sole cause: Fair Treatment. It was indeed the rise of Mahatma Gandhi, not just as a political leader, but the voice for the voiceless. A public service barrister. In his own words, and I quote, “To find the better side of human nature, a lawyer must unite parties, river asunder.”\nPart 3 - His Philosophy Gandhi’s self-reliant nature is possibly what I admire most about the man. His ability to perform tasks like washing his own clothes or cutting his own hair. It came at the cost of ridicule, yet his determination was unhindered.\nWhile he stayed with Gokhale, he learns of the dedication required to do public service, and how his hectic schedule restrained him from taking long walks or exercise. He thus emphasizes the reader to prioritize one’s health and well-being. This one I liked too.\nHowever, there are some aspects of his philosophy that I find unnecessary. For instance, he believes, vows don’t close the door to freedom but open them. And caring for children is inconsistent (more on this later) with doing public work, which again is quite the contrary.\nWhen faced with adversity, Gandhi doesn’t succumb. He recounts a tough moment when his son, Manilal fell ill, and the doctor prescribed eggs and chicken broth, which is contrary to Gandhi’s vegetarianism principles. This situation truly tested his conviction. Nevertheless, Gandhi perseveres and sticks to his values, and cares for his son, leaving no stone unturned.\nI beleive in a balanced diet. In fact I encourage cooked green vegetables as an essential in your meal. I say this, for Gandhi advocates self-control in every aspect, including diet. According to him, control of the palate – simple, spiceless, and uncooked foods – to restrain the senses and passions of life. I disagree with this perspective for the most part. It reminds me of a quote from one of my favorite authors of the 19th century.\n“The only way to get rid of a temptation is to yield to it. Resist it, and your soul grows sick with longing for the things it has forbidden to itself, with desire for what its monstrous laws have made monstrous and unlawful.”\nI find some of these teachings for the modern life challenging, and I daresay unrealistic for everyone. Everyone. for a great man like Gandhi, it’s a breeze.\nAnother aspect of Gandhi’s principle I can appreciate and encourage though, is his emphasis on cleanliness and sanitation. Despite his efforts on hygiene on third-class passenger trains or places of the divine, the reality even today is far from ideal. He proposes solutions, yet the unsanitary habits we have accustomed ourselves with is disheartening. It is nothing, but a lost cause. From my experience nothing much has changed.\nPart 4 \u0026 5 – soon.\nQuote of the month I have nothing new to teach the world, Truth and non-violence are as old as the hills. "},"title":"The Story Of My Experiments With Truth"},"/blog/indus-app-store/":{"data":{"":" Phonepe launched Indus App Store as an alternative to the Google Play Store. I wouldn’t call it a revolutionary product per se, as phone manufacturers already bundle their own app stores on their phones.\nIt is good news for developers though, as there is 0% commission on in-app subscriptions and low fees in comparison to the Google Play Store. As a consumer, to use Indus App Store since it is a “Make in India” product does not cut it for me. I avoid Samsung Galaxy Store, and God Forbid if I use Xiaomi GetApps out of despair; Similarly Indus lacks a compelling reason for anyone to go through the installing process.\nIn a competing market it is a better alternative albeit with a caveat. Indus App Store can be better than GetApps, Galaxy Store, or even Google Play Store if the company conducts thorough and rigorous security checks before allowing apps into their app store. Executing this task is easier said than done.\nAssuming they do capture a significant market share from Google, it would be difficult for them to screen millions of apps. After all, a tech giant like Google itself suffers from this same problem1 Furthermore, being a for-profit, their focus shifts more towards generating revenue than security of the platform anyways.\nAnother primary challenge for Indus is convince users to install their app. If it fails, I am assuming they would bundle it as a pre-installed app, which I would consider bloatware.\nIndus may be the alternative you are looking for if you want to steer clear from Google, however if I had to install something on my own, I would install F-droid as it is free and open-source, that is developed and maintained by a transparent community.\nhttps://www.wired.com/story/google-play-store-malware/ ↩︎"},"title":"Indus App Store"},"/blog/jawan/":{"data":{"":"last thursday, i went to watch the socio-political action thriller, “Jawan”.\nthere were two compelling reasons i couldn’t afford to miss this film: first, my unwavering admiration for the superstar Shah Rukh Khan, and second, my curiosity about the unique mummified look that had been teased.\napart from this, there was the film’s antagonist played by our very own Makkal Selvan, whose outstanding portrayal of “Michael Vedanayagam” in the web series Farzi had left a lasting impression on me. his performance was a delightful blend of ruthlessness, humor, and sheer entertainment in the show. it was evident that he brought the same brutality in jawan. lastly, of course, Nayanthara and Deepika, whose brief appearance had a significant impact in the story.\ntalking of the story – i knew since the moment i stepped in, it would have Atlee’s trademark style – a dramatic narrative with a strong social message and a hallmark of masala films – when the hero is in danger, call the hero himself to save the day.\nwhat is memorable about jawan though, is the opening sequence. Atlee skillfully packages the stardom of SRK, and lets us have a seat for the grand and dramatic face reveal. a few glimpses doesn’t cut it, oh no, it has to be extravagant. is it realistic, heck no, but was it exciting and undeniably cool, HELL YEAH! it was one of those moments you cannot get your eyes out of. it leaves you spellbound even though you know what’s coming.\nspeaking of SRK, he is the villianous, bald, mysterious vigilante. he is also a super cool jawan, with a moustache to die for. and in the second half with slick action sequences in his wolverine-like appearance, it was nothing short of paisa wasool entertainment.\nanother reason not to miss this film is Anirudh’s music. he delivers cinematic bangers at this point. while the songs were mediocre at best, the background score packs a punch.\nif you like indian films or not, one thing is for sure though, this film would make your heart go maasi, maasi, maasi, maasi, maasi, maasi, maasi .."},"title":"jawan - a review"},"/blog/mpv-scripts/":{"data":{"#":"in this blog, i will share a list of no-nonense scripts for mpv.\nif you are not using mpv, and using something else – here are few reasons why you must consider it:\nlightweight customizable with scripting support relatively easy to setup and use faster than vlc Scripts1. mpv chapters1 Display chapters and allow you to jump to them with a mouse click. as easy as saving the file in your scripts/ folder. press TAB to display the chapters. https://github.com/zxhzxhz/mpv-chapters\n2. mpv thumbnails script2 Display preview thumbnails when hovering over the seekbar.\nhttps://github.com/marzzzello/mpv_thumbnail_script\nSetup copy the 2 scripts from the releases page and place them in your config file: $HOME/.config/mpv/scripts/ set ‘osc=no’ or un-comment the link in your mpv.conf file in the path $HOME/.config/mpv/mpv.conf If you want to take a look at other user scripts, you can view them here\nhttps://github.com/zxhzxhz/mpv-chapters ↩︎\nhttps://github.com/marzzzello/mpv_thumbnail_script ↩︎","scripts#Scripts":""},"title":"mpv scripts"},"/blog/solving-captchas/":{"data":{"#":"\nsolving captcha programatically is a pain. me and this other dude at work took about two weeks to solve version 2 of google recaptcha which we learned later, was an enterprise versioned captcha. i did not understand what that meant, until i read between the lines of the docs.\nthis blog is a simple sidenote on how to solve recaptcha (v2) with 2captcha API. you can read the docs, which btw, is amazing.\nprequisities 2captcha API key install requests step 1 right click around the captcha area –\u003e inspect element\nstep 2 find the “data-sitekey” parameter and copy the value. this will be the ‘googlekey’ value.\nstep 3 send a http GET request to submit a captcha.\nimport requests #pip install requests API_KEY = '1abc234de56fab7c89012d3' URL = 'http://2captcha.com/in.php' SITE = 'https://site-with-captcha.com' response = requests.get(URL, params = { 'key': API_KEY, 'method': 'userrecaptcha', 'googlekey': 'key-from-step2', 'pageurl' : SITE }) step 4 if you came this far, you will get the ID of your captcha as plain text, like:\nOK|2122988149 if you get an error message, do not proceed to the next step. refer the documentation if you get any errors.\nstep 5 make a 15-20 seconds timeout and then, submit another GET request:\nURL = 'http://2captcha.com/res.php' response = requests.get(URL, params = { 'key':API_KEY, 'action': get, 'id': 2122988149 }) if captcha is already solved, server will respond with a randomly generated token. if it does not, you can repeat your request in 5 seconds.\nstep 6 in developer’s console, find the textarea with id=“g-recaptcha-response”, and send the received code.\ni used selenium to send the code back like so:\ndriver.execute_script(\"\"\" document.getElementById( \"g-recaptcha-response\" ).innerText='2122988149'; \"\"\") Then you can submit the captcha response, and recaptcha will be solved.\nNote: there is a high possibility these steps won’t work. if you are looking for a direct method, you can find it here","prequisities#prequisities":""},"title":"solving captchas"},"/blog/sphinx/":{"data":{"":"Sphinx is a powerful tool to create beautiful documentation by converting plain text source files into various output formats, like HTML, PDFs, LateX.\nSphinx uses the reStructuredText markup language by default, and can read MyST markdown via third-party extensions. Both of these are powerful and straightforward to use, and have functionality for complex documentation and publishing workflows. They both build upon Docutils to parse and write documents.","adding-extensions#Adding extensions":" go to docs/source/conf.py # Add any Sphinx extension module names here, as strings. They can be # extensions coming with Sphinx (named 'sphinx.ext.*') or your custom # ones. extensions = [ 'sphinx.ext.duration', ] Customize your Sphinx documentation effortlessly with these steps!","installation#Installation":" Create a virtual environment. $ python -m venv venv Install Sphinx pip install sphinx Activate Environment in powershell/terminal Windows .\\venv\\Scripts\\activate Linux source env/Scripts/activate ","prerequisites#Prerequisites":" Python 3.8 or later. ","setup#Setup":" Create Docs Layout With this command, all the documentation will be in the docs folder. sphinx-quickstart docs Inputs These inputs are required when you enter the command from step 1. Separate source and build directories (y/n) [n]: y [Default is **y**] project name: \u003center your project name\u003e Author name(s): \u003cyour name\u003e Project release []: \u003crelease version\u003e Project language [en]: en Build the project sphinx-build -M html docs/source/ docs/build/ To check the generated html, open the index.html file in the build/html folder. "},"title":"Sphinx Setup Guide"},"/blog/stop-using-whatsapp/":{"data":{"":"It’s disheartening to go against what is a lost cause. To tell someone to stop using whatsapp in India is like ripping off their right to communicate freely. Nobody cares about privacy around here. If someone likes me tells them their favorite messaging app is invasive, they tend to prompt questions that imply I may have something to hide. Well in truth, Whatsapp is a closed-source, zuckbook-backed, data-mining company, which in many ways is compromised. With this in mind, you cannot argue that you don’t care about privacy and it is stupid.\nEdward Snowden said it best: “Arguing that you don’t care about privacy becaue you have nothing to hide is no different than saying you don’t care about free speech because you have nothing to say”\nWhat is worse? Whatsapp falsely claims to be a private messaging app, providing end-to-end encryption to your messages. In reality, Whatsapp moderators1 can read your messages, and they love to share your metadata with law enforcement and other third-party companies, not only because it has to comply, or earn a profit, but to build a relationship map.\nA relationship map is an identity that can be derived from just who you associate with, which basically just cancels out the encryption and privacy claim. One could argue that the constant lies is the problem, but you need to ask yourself, if whatsapp was a person, would you trust it?\nHere’s a fun fact: The Zuck himself does not use whatsapp. Yet we Indians are accustomed to Good Morning texts and “forwards” that our minds have become numb, like the lizard person dumb founded by gathering all that data.\nI agree it is hard to break loose from this dopamine induced eco-system. After all, the primary reason why people can’t stop using whatsapp is because everyone is on it, akin to the same problem instagram suffers with. If your friends and family use whatsapp, instagram and zuckbook, one must be mad to think of using an alternative. Moreover, to succeed at bringing all your friends and family into a different platform is like compelling them to the dance floor.\nThis is one of those gotcha moments of the Zuck; a trap designed to chain your freedom. But if you are someone who values privacy and respects yourself, I would suggest you to try Signal and encourage others to use it. It is a better app for personal and intimate conversations with your friends and family.\nhttps://gizmodo.com/whatsapp-moderators-can-read-your-messages-1847629241 ↩︎"},"title":"Stop Using Whatsapp"},"/blog/support-for-palestine/":{"data":{"":"All the big news organizations are known for manipulating facts and having biased opinions. If you think there are not taking a side, you are overly optimistic. Moreover, relying on a for-profit major news organizations is akin to burying one’s head in the sand and trusting whatever information comes along. It is a no-brainer. Their support for Israel makes it even more clear of their ignorance. More civilians are killed by Israel and they will never show you that.\nAn eye for an eye makes the whole world blind. They will never tell you Hamas is NOT Palestine.\nIn addition to news organizations, there are a certain “smart” people which I have found myself losing a lot of respect for. Despite their extensive knowledge in their respective fields, it’s disheartening to see they do not see the bigger picture and prioritize personal interests over basic human rights.\nTheir unwavering support for Israel is crystal clear that they cannot be trusted. It is disturbing to see their indifference towards the consequences of Israeli actions on Palestinian civilians, especially considering that over half of the population comprises children.\nGenerally I oppose the use of social media, however in a time like this, people who actively use it must not remain silent on such matters, considering how swiftly people post about trending topics. It’s crucial to recognize that silence can inadvertently contribute to the perpetuation of hatred. If it does not happen to you, that doesn’t mean you need to turn a blink eye, and that is the message of this blog.\nSocial tensions after World War II convinced the “Zionist Jews” that they need their own country.1. 20 years later, here’s how Palestine occupied area looks like: Albert Einstein on Palestine: 2\n“I am in favor of Palestine being developed as a Jewish Homeland but not as a separate state. It seems to me a matter of simple common sense that we cannot ask to be given political rule over Palestine where two thirds of the population are not Jewish.”\n– January 19, 1946\nMany Jews (except the Zionists)3 are still of the opinion to free Palestine and to live in peace with each other.4\nhttps://www.vox.com/2018/11/20/18080016/israel-zionism-war-1948 ↩︎\nhttps://countercurrents.org/2023/10/einstein-cited-equally-horrific-terrorist-massacre-of-arabs-usa-origin-of-killing-in-palestine/ ↩︎\nhttps://www.theguardian.com/world/2023/oct/19/jewish-protest-israel-gaza-washington-dc ↩︎\nhttps://www.annefrank.org/en/topics/antisemitism/are-all-jews-zionists/ ↩︎"},"title":"In Support for Palestine"},"/blog/umami/":{"data":{"":"I always sought after an open-source solution for web analytics primarily to track visitor counts on my site. While I used Google Analytics for a few months due to its seamless integration with Hugo, it was without a doubt contradicting to my ethical principles.\nSo starting today, this site will be using umami[^1] for web analytics. I opted umami because it is open-source, privacy-focused and the setup takes less than 10 minutes! Here’s how you can integrate it in your website –","prerequisites#Prerequisites":" A working Hugo Site Umami Account ","set-up#Set Up":" Locate the Base Template File In Hugo, the base template file is either baseof.html or base.html.\nYou can find this typically in layouts/_default/baseof.html\nFind the Head Section If you don’t find the \u003chead\u003e tag in base.html, look for a head.html file in your partials/ folder.\nInside the head section, you need to add the script tag which was generated after you created your umami account.\n\u003cscript async src=\"https://example.com/path/to/script.js\" data-website-id=\"a1a11aaa1-a1a1a1a-a1a1a1a1-a1a1a1a1\"\u003e\u003c/script\u003e Save the changes and rebuild your Hugo site. Voila, umami is analyzing traffic.. unagi!"},"title":"Integrate Umami on your Hugo Site"},"/blog/xz-backdoor/":{"data":{"":"I already made a blog post on archiving files using tar that covered gzip, a utility tool to archive files with compression. In the same way, xz utils is an open-source lossless data compression tool primarily focused on the .xz file format, suitable for archiving large amount of data.\nLately xz has been a victim to a highly sophisticated attack aimed at injecting a secret backdoor, that resulted in compromise of numerous distributions such as Debian, Kali, and openSUSE. This attack gave malicious actors Remote Code Execution (RCE) privileges.\nLuckily though, a Microsoft engineer Andres Freund discovered this issue by pure luck and reported the issue when malicious code was found in a tar ball of liblzma (a library to implement compression).\nThe malicious actor who signed the tarball was a long-standing contributor to the project, who had built trust for years. While the original maintainer was inactive in the project, this bad actor by the name “Jia Tan” earned the community’s confidence through their positive contributions.\nThis serves as a reminder to always do your due diligence,as with great power comes great responsibility."},"title":"xz has a secret backdoor"},"/braindump/":{"data":{"":"all my braindumps are listed here.\n06-03-2024 — Signal Gets Usernames! 17-02-2024 — Best Way to Download Youtube Videos 11-02-2024 — How to check CPU Usage in the Terminal? 09-01-2024 — Ram’s Wise Mind 17-11-2023 — json.dumps vs json.loads 02-10-2023 — Activate Virtual Environments in Powershell 11-09-2023 — setting up proxies (IP authentication) with Selenium and Python "},"title":"Braindump"},"/braindump/cpu-usage-terminal/":{"data":{"":"","#":"I like to optimize my system’s performance and like it even more if the cpu usage is at the bare minimum. To me these commands are a must for system administration and performance monitoring.\nDisplay all CPU information cat /proc/cpuinfo Shows CPU usage grep \"cpu MHz\" /proc/cpuinfo Updates CPU usage every 2s watch grep \\\"cpu MHz\\\" /proc/cpuinfo Watches CPU usage every 1s watch -n 1 grep \\\"cpu MHz\\\" /proc/cpuinfo "},"title":"How to check CPU Usage in the Terminal?"},"/braindump/json-dumps-vs-loads/":{"data":{"":"Do you often google the difference between json.dump(s) and json.loads(s) while working with json data in Python?\nWell then, this will be your quick guide to distinguish these functions.","examples#Examples":"Assume you have a file named ‘data.json’ with the following:\n{ \"name\": \"Joe\", \"age\": 25, \"city\": \"Mumbai\" } json.load() load JSON data from a file. import json with open('data.json', 'r') as file: data = json.load(file) print(data) Output:\n{'name': 'Joe', 'age': 25, 'city': 'Mumbai'} json.loads() load JSON data from a string. import json json_str = '{\"name\": \"Jane\",\"age\": 30, \"city\": \"Bangalore\"}' data = json.loads(json_str) print(data) Output:\n{'name': 'Jane', 'age': 30, 'city': 'Bangalore'} json.dump() write JSON data to a file. import json data = {\"name\": \"Grace\", \"age\": 23, \"city\": \"Chennai\"} with open('output.json', 'w') as file: json.dump(data, file) Output:\n{\"name\": \"Grace\", \"age\": 23, \"city\": \"Chennai\"} json.dumps() convert a Python object to a JSON-formatted string. import json data = {\"name\": \"Gary\", \"age\": 28, \"city\": \"Delhi\"} json_string = json.dumps(data) print(json_string) Output\n{\"name\": \"Gary\", \"age\": 28, \"city\": \"Delhi\"} SUMMARY load - for reading JSON from a file. loads - for reading JSON from a string. dump - for writing JSON to a file. dumps - for converting a Python object to a JSON-formatted string. ","the-difference#The difference":" Quite literally, json.load() and json.loads() loads json into your program, while json.dump() and json.dumps() dump data in JSON. Why the extra “s” though? json.dumps() and json.loads() deal with JSON data in the form of a string. ℹ️ Remember: s for string Use load \u0026 dump when dealing with a file; loads and dumps when dealing with a string. "},"title":"Json Dump(s) vs Load(s)"},"/braindump/proxy-auth/":{"data":{"":"","#":"this is a sample configuration of using proxies with IP authentication, using selenium and python.\nsample code CHROMEDRIVER_PATH = /path/to/chromedriver PROXY = \"23.23.23.23:3128\" # IP:PORT URL = 'https://example.com' from seleniumwire import webdriver from selenium.webdriver.chrome.options import Options from selenium.webdriver.chrome.service import Service options = Options() options.add_argument('--proxy-server=%s' % PROXY) s = Service(CHROMEDRIVER_PATH) driver = webdriver.Chrome(service=s, options=options) driver.get(URL) what if the connection is insecure? install this certificate\nor get the certificate using: python -m seleniumwire extractcert after the certificate is installed,\nopen chrome settings select “Privacy and Security” under “Advanced” setting, click “Manage device certificates” then, click “Trusted Root Certification Authority” -\u003e “import” import the certificate you just have downloaded. this will make the connection secure."},"title":"setting up proxies in selenium"},"/braindump/rams-wise-mind/":{"data":{"":"Sarat Chandra Chattopadhyay’s short story “Ram’s Wise Mind” (or Ramer Shumoti) is a poignant story of a seventeen year old boy, Ramlaal and his sister-in-law Narayani.\nThough Ram is troublesome and mischievous in the eyes of many, he is not to Narayani. She assumes the role of a mother-figure to him, adding a layer of complexity and tenderness to their relationship.\nChattopadhyay’s storytelling shines as he paints a vivid picture of the emotional landscape between Ram and Narayani. Their bond becomes a testament to the enduring power of human connection, defying societal norms and expectations.\nFor those seeking a literary experience that elegantly captures the intricacies of human emotion, this short story is a compelling choice."},"title":"Ram's Wise Mind"},"/braindump/signal-gets-usernames/":{"data":{"":"Signal is a great messaging app for private digital communications. Features like end-to-end encryption, privacy and security is time-tested.\nWith the introduction to usernames, exposure to phone numbers is minimal. It is a great feature to have when you do not want to share your number with someone for a chat. The phone number is used for sign up, however it will no longer be visible to everyone on Signal.\nThis is wonderful news for privacy and security enthusiasts, journalists, whistleblowers, and a big win for digital freedom."},"title":"Signal Gets Usernames!"},"/braindump/venv/":{"data":{"":"","#":"I love the simplicity of Linux and Bash. Probably why I prefer it over the unneccesary complexities of powershell. Nonetheless I am using it to familiarize myself with the commands.\nI was using Git Bash that ships with git for Windows, until I discovered the power of Windows Terminal1, an exceptional terminal emulator that enhanced my “Windows experience.”\nI like the seamless integration between different shells and its customizability, in contrast to the uninspiring blue powershell.\nI have a fair share of issues with powershell. One of them was to active a python virtual environment.\nSimple fix Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Unrestricted https://github.com/microsoft/terminal ↩︎"},"title":"Activate Virtual Environments in Powershell"},"/braindump/ytdlp/":{"data":{"":"There was a time when it became incredibly difficult to make yt-dl work,due to several takedown notices from youtube. From personal experience, if it worked for me once, it wouldn’t work for the rest. It was frustrating to use third-party ad-ware sites to download anything off youtube.. until I discovered a (fork of yt-dl) better tool: YT-DLP.\nIt is one of those things that makes me really admire the efforts of the open-source community. In this post, I will share my go-to commands for using yt-dlp.","alias#Alias":" Obviously you can add this as an alias in your .bashrc or your .zshrc like so: alias yta=\"yt-dlp -x --audio-format best --embed-thumbnail\" YT-DLP’s Github: ","install#Install":"sudo wget https://github.com/yt-dlp/yt-dlp/releases/latest/download/yt-dlp -O /usr/local/bin/yt-dlp sudo chmod a+rx /usr/local/bin/yt-dlp ","usage#Usage":" Download and merge the best video-only format and the best audio-only format, or the best combined format (if video-only format is not available) $ yt-dlp -f \"bv+ba/b\" \u003clink\u003e Download a video in 1080p yt-dlp -f 'bv*[height=1080]+ba' \u003clink\u003e Download an audio while embedding thumbnail in the file. yt-dlp -x --audio-format best --embed-thumbnail \u003clink\u003e "},"title":"Best way to download Youtube Videos"},"/contact/":{"data":{"":"I primarily use signal for messaging. Scan below QR for a chat.\nClick on the icons below for other stuff"},"title":"Contact"},"/explore/":{"data":{"":" Blog Braindump Music My Personal Library Resources "},"title":"Categories"},"/library/":{"data":{"":"","fiction#Fiction":"","non-fiction#Non-Fiction":"","philosophy#Philosophy":"","plays#Plays":"","poetry#Poetry":"This page contains a list of books from my personal library. While I don’t consider myself to be a book hoarder, I do have a reasonable number to display them here.\nif you have any questions or want to recommend or review any book, you can do that here\nthe books are categorized by genre, and each genre is arranged chronologically based on the author’s name.\nFiction Adiga, Arvind – The White Tiger Alcott, Louisa May – Little Women Archer, Jeffrey – A Prisoner of Birth Austen, Jane – Pride and Prejudice Bond, Ruskin – The Blue Umbrella Bond, Ruskin – The Girl on the Train Brontë, Charlotte – Jane Eyre Brontë, Emily – Wuthering heights Chattopadhyay, Sarat Chandra – Datta (Betrothed) Chattopadhyay, Sarat Chandra – Ramer Shumoti (Ram’s Wise Mind) Christie, Agatha – The Murder on the Links Christie, Agatha – The Mysterious Affair at Styles Christie, Agatha – Where the light lasts Coelho, Paulo – Adultery Coelho, Paulo – The Devil and Miss Prym Coelho, Paulo – The Spy Coelho, Paulo – Veronica Decides to Die Conrad, Joseph – Heart of Darkness Dickens, Charles – A Christmas Carol Dostoyevsky, Fyodor – Crime and Punishment Doyle, Arthur Conan – The Complete Novels of Sherlock Holmes Doyle, Aruthur Conan – The Hound of the Baskervilles Fitzgerald, Scott F. – The Great Gatsby Flynn, Gillian – Gone Girl Flynn, Gillian – The Grownup Forster, E.M – A Passage to India Ghosh, Amitav – The Shadow Lines Hemingway, Ernest – The Old Man and the Sea Henry, O – Best of O’Henry Hosseini, Khaled – A Thousand Splendid Suns Jerome, Jerome K. – Three Men in a Boat Kafka, Franz – Metamorphosis Kafka, Franz – The Trial King, Stephen – The Shining King, Stephen – IT Kipling, Rudyard – The Jungle Book Lee, Harper – To Kill a Mockingbird Manto, Saadat Hasan – Selected Short Stories (Aatish Taseer) Morrison, Toni – Beloved Murakami, Haruki – Birthday Girl Murakami, Haruki – Kafka on the Shore Murthy, Sudha – Three Thousand Stitches Nabokov, Vladimir – Lance Orwell, George – 1984 Orwell, George - Animal Farm Poe, Edgar Allan – Selected Tales Plath, Sylvia – The Bell Jar Puzo, Mario – The Godfather Ray, Satyajit – Sonar Kella (The Golden Fortress) Ray, Satyajit – Chhinnamastar Abhishap (The Curse of the Goddess) Roy, Arundhathi – The God of Small Things Salinger, J.D – Catcher in the Rye Shelly, Mary – Frankenstein Singh, Khushwant – Train to Pakistan Smith, Zadie - White Teeth Stoker, Bram – Dracula Tagore, Rabindranath - Nashtanirh (Broken Nest) Twain, Mark – The Adventures of Huckleberry Finn Twain, Mark – The Adventures of Tom Sawyer Wells, H.G – The Time Machine Wharton, Edith – The Age of Innocence Wilde, Oscar – The Picture of Dorian Grey Non-Fiction Achebe, Chinua – Africa’s Tarnished Name Albom, Mitch – Tuesdays with Morrie Allen, James – As a Man Thinketh Ambedkar, B.R – Ambedkar’s India Brandt, Charles – I Heard You Paint Houses Benyamin – Goat Days Dickens, Charles – Night Walks Durrani, Tehmina – My Feudal Lord Frank, Anne – The Diary of a Young Girl Gandhi, Mahatma – The Story of my Experiments with Truth Grover, Ashneer – Doglapan: The Hard Truth about Life and Start-ups Marx, Karl – The Communist Manifesto Mukherjea, Saurabh / Ranjan, Rakshit / Uniyal, Pranab - Coffee Can Investing Singh, Khushwant – The End of India Tagore, Rabindranath – Nationalism Tzu, Sun – The Art of War Philosophy Aristotle - Poetics Camus, Albert – The Myth of Sisyphus Nietzsche, Friedrich Wilhelm – Thus Spake Zarathustra Seneca - Letters from a Stoic Plays Christie, Agatha – The Mousetrap \u0026 Selected Plays Miller, Arthur – Death of a Salesman Shakespeare, William – Julius Caesar Shakespeare, William – Macbeth Shakespeare, William – Othello Shakespeare, William – The Comedy of Errors Wilde, Oscar – The Importance of Being Earnest Poetry Brontë, Emily – The Night is Darkening Round Me Hafez – The Nightingales are drunk Gibran, Kahlil – The Prophet Keats, John – The Eve of St.Agnes Shakespeare, William – Sonnets Whitman, Walt – On the Beach at Night Alone "},"title":"My Personal Library"},"/music/":{"data":{"":"","#":"This is a compiled list of my absolute favorites. Whether you’re craving something fresh, or downright extraordinary, my playlist has got you covered.\nLife is for the living. Death is for the dead. Let life be like music. And death a note unsaid.\nSounds of Silence – If I mention S\u0026G, most draw a blank face with an intrigue to know more. The moment I quote, “Hello darkness, my old friend..” it’s like a lightbulb moment – everyone gets it.\nMe Against The World – What sets 2Pac apart from others is that he carries an unmatched resonance. His music is deeply personal, poetic and lyrical.\nBlood On The Tracks – My man is at his rawest best. Whether it is Tangled up in Blue, or “Idiot Wind”, It’s refreshing each time you listen to this album.\nThe Marshall Mathers LP – A lyrical genius. I won’t be suprised if people have listened to this entire album without realizing it."},"title":"My Favorite Music"}}