{"/blog/":{"data":{"":" RSS Feed "},"title":"Blog"},"/blog/firstblog/":{"data":{"":"in the vast expanse of the internet, i have constructed a small place of my own – a webpage, with a philosophy of its own.\nso if you don’t know me, let me tell you, i like simple stuff. and strangely enough i chose not to make this site super responsive with a shit-load of javascript. oh yes, if you have not guessed it already, i used a static site generator for this page. to be precise, hugo. with a minimal theme under the hood and an elegant design, i am sure you might be really impressed by the responsiveness and the speed of my page.\nbut you might be wondering why a webpage? i am going to tell you even if you are not wondering though.\nin all honesty, i wanted to have a place of my own on the internet: to have the freedom to put whatever i want in one place, rather than scattering it all around social media accounts. i can share this one link with anyone and BOOM! access to everything i post. sounds kind of like linktree, which sounds like a great idea if you are lazy to make a simple html page. hehe.\ni also don’t like the idea of getting into social media again, so this would be my ideal place, where random people can find my site and admire the simplicity of it, and of course know me.\nso if you want to subscribe to my rss or would like to keep visiting my webpage, here are a few things i will write about\ncinema technology literature anything about life new stuff i learned linux philosophy sports (cricket, maybe) an endless list of links. i have been wanting to do this for about a year now and here we are! i like my hecking site and i hope you do too.\nif you find any issues with my site, you can submit it here or contact me"},"title":"first blog"},"/blog/solving-captchas/":{"data":{"#":"\nsolving captcha programatically is a pain. me and this other dude at work took about two weeks to solve version 2 of google recaptcha which we learned later, was an enterprise versioned captcha. i did not understand what that meant, until i read between the lines of the docs.\nthis blog is a simple sidenote on how to solve recaptcha (v2) with 2captcha API. you can read the docs, which btw, is amazing.\nprequisities 2captcha API key install requests step 1 right click around the captcha area –\u003e inspect element\nstep 2 find the “data-sitekey” parameter and copy the value. this will be the ‘googlekey’ value.\nstep 3 send a http GET request to submit a captcha.\nimport requests #pip install requests API_KEY = '1abc234de56fab7c89012d3' URL = 'http://2captcha.com/in.php' SITE = 'https://site-with-captcha.com' response = requests.get(URL, params = { 'key': API_KEY, 'method': 'userrecaptcha', 'googlekey': 'key-from-step2', 'pageurl' : SITE }) step 4 if you came this far, you will get the ID of your captcha as plain text, like:\nOK|2122988149 if you get an error message, do not proceed to the next step. refer the documentation if you get any errors.\nstep 5 make a 15-20 seconds timeout and then, submit another GET request:\nURL = 'http://2captcha.com/res.php' response = requests.get(URL, params = { 'key':API_KEY, 'action': get, 'id': 2122988149 }) if captcha is already solved, server will respond with a randomly generated token. if it does not, you can repeat your request in 5 seconds.\nstep 6 in developer’s console, find the textarea with id=“g-recaptcha-response”, and send the received code.\ni used selenium to send the code back like so:\ndriver.execute_script(\"\"\" document.getElementById( \"g-recaptcha-response\" ).innerText='2122988149'; \"\"\") Then you can submit the captcha response, and recaptcha will be solved.\nNote: there is a high possibility these steps won’t work. if you are looking for a direct method, you can find it here","prequisities#prequisities":""},"title":"solving captchas"},"/braindump/":{"data":{"":"all my braindumps are listed here.\n02-10-2023 — Activate Virtual Environments in Powershell 11-09-2023 — setting up proxies (IP authentication) with Selenium and Python "},"title":"Braindump"},"/braindump/proxy-auth/":{"data":{"":"","#":"this is a sample configuration of using proxies with IP authentication, using selenium and python.\nsample code CHROMEDRIVER_PATH = /path/to/chromedriver PROXY = \"23.23.23.23:3128\" # IP:PORT URL = 'https://example.com' from seleniumwire import webdriver from selenium.webdriver.chrome.options import Options from selenium.webdriver.chrome.service import Service options = Options() options.add_argument('--proxy-server=%s' % PROXY) s = Service(CHROMEDRIVER_PATH) driver = webdriver.Chrome(service=s, options=options) driver.get(URL) what if the connection is insecure? install this certificate\nor get the certificate using: python -m seleniumwire extractcert after the certificate is installed,\nopen chrome settings select “Privacy and Security” under “Advanced” setting, click “Manage device certificates” then, click “Trusted Root Certification Authority” -\u003e “import” import the certificate you just have downloaded. this will make the connection secure."},"title":"setting up proxies in selenium"},"/braindump/venv/":{"data":{"":"","#":"I love the simplicity of Linux and Bash. Probably why I prefer it over the unneccesary complexities of powershell. Nonetheless I am using it to familiarize myself with the commands.\nI was using Git Bash that ships with git for Windows, until I discovered the power of Windows Terminal1, an exceptional terminal emulator that enhanced my “Windows experience.”\nI like the seamless integration between different shells and its customizability, in contrast to the uninspiring blue powershell.\nI have a fair share of issues with powershell. One of them was to active a python virtual environment.\nSimple fix Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Unrestricted https://github.com/microsoft/terminal ↩︎"},"title":"Activate Virtual Environments in Powershell"},"/contact/":{"data":{"":" Click on the icons below to contact me!\ncontact me using ‘unchaineddev’ on the platform https://jami.net"},"title":"Contact"},"/explore/":{"data":{"":" Braindump My Personal Library Resources Music "},"title":"Categories"},"/library/":{"data":{"":"","fiction#Fiction":"","non-fiction#Non-Fiction":"","philosophy#Philosophy":"","plays#Plays":"","poetry#Poetry":"This page contains a list of books from my personal library. While I don’t consider myself to be a book hoarder, I do have a reasonable number to display them here.\nif you have any questions or want to recommend or review any book, you can do that here\nthe books are categorized by genre, and each genre is arranged chronologically based on the author’s name.\nFiction Adiga, Arvind – The White Tiger Alcott, Louisa May – Little Women Archer, Jeffrey – A Prisoner of Birth Austen, Jane – Pride and Prejudice Bond, Ruskin – The Blue Umbrella Bond, Ruskin – The Girl on the Train Brontë, Charlotte – Jane Eyre Brontë, Emily – Wuthering heights Chattopadhyay, Sarat Chandra – Datta (Betrothed) Chattopadhyay, Sarat Chandra – Ramer Shumoti (Ram’s Wise Mind) Christie, Agatha – The Murder on the Links Christie, Agatha – The Mysterious Affair at Styles Christie, Agatha – Where the light lasts Coelho, Paulo – Adultery Coelho, Paulo – The Devil and Miss Prym Coelho, Paulo – The Spy Coelho, Paulo – Veronica Decides to Die Conrad, Joseph – Heart of Darkness Dickens, Charles – A Christmas Carol Dostoyevsky, Fyodor – Crime and Punishment Doyle, Arthur Conan – The Complete Novels of Sherlock Holmes Doyle, Aruthur Conan – The Hound of the Baskervilles Fitzgerald, Scott F. – The Great Gatsby Flynn, Gillian – Gone Girl Flynn, Gillian – The Grownup Forster, E.M – A Passage to India Ghosh, Amitav – The Shadow Lines Hemingway, Ernest – The Old Man and the Sea Henry, O – Best of O’Henry Hosseini, Khaled – A Thousand Splendid Suns Jerome, Jerome K. – Three Men in a Boat Kafka, Franz – Metamorphosis Kafka, Franz – The Trial King, Stephen – The Shining King, Stephen – IT Kipling, Rudyard – The Jungle Book Lee, Harper – To Kill a Mockingbird Manto, Saadat Hasan – Selected Short Stories (Aatish Taseer) Morrison, Toni – Beloved Murakami, Haruki – Birthday Girl Murakami, Haruki – Kafka on the Shore Murthy, Sudha – Three Thousand Stitches Nabokov, Vladimir – Lance Orwell, George – 1984 Orwell, George - Animal Farm Poe, Edgar Allan – Selected Tales Plath, Sylvia – The Bell Jar Puzo, Mario – The Godfather Ray, Satyajit – Sonar Kella (The Golden Fortress) Ray, Satyajit – Chhinnamastar Abhishap (The Curse of the Goddess) Roy, Arundhathi – The God of Small Things Salinger, J.D – Catcher in the Rye Shelly, Mary – Frankenstein Singh, Khushwant – Train to Pakistan Smith, Zadie - White Teeth Stoker, Bram – Dracula Tagore, Rabindranath - Nashtanirh (Broken Nest) Twain, Mark – The Adventures of Huckleberry Finn Twain, Mark – The Adventures of Tom Sawyer Wells, H.G – The Time Machine Wharton, Edith – The Age of Innocence Wilde, Oscar – The Picture of Dorian Grey Non-Fiction Achebe, Chinua – Africa’s Tarnished Name Albom, Mitch – Tuesdays with Morrie Allen, James – As a Man Thinketh Ambedkar, B.R – Ambedkar’s India Brandt, Charles – I Heard You Paint Houses Benyamin – Goat Days Dickens, Charles – Night Walks Durrani, Tehmina – My Feudal Lord Frank, Anne – The Diary of a Young Girl Gandhi, Mahatma – The Story of my Experiments with Truth Grover, Ashneer – Doglapan: The Hard Truth about Life and Start-ups Marx, Karl – The Communist Manifesto Mukherjea, Saurabh / Ranjan, Rakshit / Uniyal, Pranab - Coffee Can Investing Singh, Khushwant – The End of India Tagore, Rabindranath – Nationalism Tzu, Sun – The Art of War Philosophy Aristotle - Poetics Camus, Albert – The Myth of Sisyphus Nietzsche, Friedrich Wilhelm – Thus Spake Zarathustra Seneca - Letters from a Stoic Plays Christie, Agatha – The Mousetrap \u0026 Selected Plays Miller, Arthur – Death of a Salesman Shakespeare, William – Julius Caesar Shakespeare, William – Macbeth Shakespeare, William – Othello Shakespeare, William – The Comedy of Errors Wilde, Oscar – The Importance of Being Earnest Poetry Brontë, Emily – The Night is Darkening Round Me Hafez – The Nightingales are drunk Gibran, Kahlil – The Prophet Keats, John – The Eve of St.Agnes Shakespeare, William – Sonnets Whitman, Walt – On the Beach at Night Alone "},"title":"My Personal Library"},"/music/":{"data":{"":"","#":"This is a compiled list of my absolute favorites. Whether you’re craving something fresh, or downright extraordinary, my playlist has got you covered.\nLife is for the living. Death is for the dead. Let life be like music. And death a note unsaid.\nSounds of Silence – If I mention S\u0026G, most draw a blank face with an intrigue to know more. The moment I quote, “Hello darkness, my old friend..” it’s like a lightbulb moment – everyone gets it.\nMe Against The World – What sets 2Pac apart from others is that he carries an unmatched resonance. His music is deeply personal, poetic and lyrical.\nBlood On The Tracks – My man is at his rawest best. Whether it is Tangled up in Blue, or “Idiot Wind”, It’s refreshing each time you listen to this album.\nThe Marshall Mathers LP – A lyrical genius. I won’t be suprised if people have listened to this entire album without realizing it."},"title":"My Favorite Music"}}