{"/blog/":{"data":{"":" RSS Feed "},"title":"Blog"},"/blog/custom-domain/":{"data":{"":"","step-1#Step 1":"","step-2#Step 2":"","step-3#Step 3":"","step-4#Step 4":"","step-5#Step 5":"There are far more problems in the world than setting up a custom domain. it’s ridiculous how a simple thing is made so complicated that any new user would break their head trying to make it work.\nin this blog, i will share how to set up a custom domain using github pages.\ni already had github pages1 set up, and i bought a domain from hostinger. if you haven’t purchased a domain, you can get it here, and if you are lazy to create a static page on your own, you can use one of these templates.\nStep 1 Deploying your page to github.\nif you need help, you can refer the docs. it’s pretty straight-forward. Step 2 Sign in to your domain.\nGo to your domain’s home page. for hostinger domains go to: hpanel Under domains, choose the domain you want to set the custom domain to by clicking on “Manage” On the left panel, click on “DNS/Nameservers” to configure the CNAME and A records. Step 3 Now this is the tricky part where most of the misconfiguration happens.\nIf you find any existing “CNAME” records or “A records”, delete them Step 4 Adding CNAME and A records\nCNAME – There must be 2 CNAME records, and both records must point to ‘your-github-username.github.io’\nFirst CNAME record must have ‘www’ Second CNAME record must be left blank After saving both CNAME records, the result should look like this.\nA Records – There are 4 github IPs we need to add to our A records, and they are as follows: 185.199.108.153\n185.199.109.153\n185.199.110.153\n185.199.111.153 After saving all the A records, the result should look like this.\nStep 5 Add the custom domain to your github.io page.\nHead to your GitHub repository and click on the Settings tab. Then, click on the Pages tab and enter your custom domain in the Custom Domain field –\u003e Hit Save Wait for 15 mins for the TLS cert to be generated. And just like that, you have set up your custom domain to GitHub Pages!\nhttps://pages.github.com/ ↩︎"},"title":"custom domain for github pages"},"/blog/firstblog/":{"data":{"":"in the vast expanse of the internet, i have constructed a small place of my own – a webpage, with a philosophy of its own.\nso if you don’t know me, let me tell you, i like simple stuff. and strangely enough i chose not to make this site super responsive with a shit-load of javascript. oh yes, if you have not guessed it already, i used a static site generator for this page. to be precise, hugo. with a minimal theme under the hood and an elegant design, i am sure you might be really impressed by the responsiveness and the speed of my page.\nbut you might be wondering why a webpage? i am going to tell you even if you are not wondering though.\nin all honesty, i wanted to have a place of my own on the internet: to have the freedom to put whatever i want in one place, rather than scattering it all around social media accounts. i can share this one link with anyone and BOOM! access to everything i post. sounds kind of like linktree, which sounds like a great idea if you are lazy to make a simple html page. hehe.\ni also don’t like the idea of getting into social media again, so this would be my ideal place, where random people can find my site and admire the simplicity of it, and of course know me.\nso if you want to subscribe to my rss or would like to keep visiting my webpage, here are a few things i will write about\ncinema technology literature anything about life new stuff i learned linux philosophy sports (cricket, maybe) an endless list of links. i have been wanting to do this for about a year now and here we are! i like my hecking site and i hope you do too.\nif you find any issues with my site, you can submit it here or contact me"},"title":"first blog"},"/blog/gandhi/":{"data":{"":"","#":"In hindsight it might seem like we are not affected by history, however, for the most part we are. Take a currency note for instance. Did you ever reflect on the man behind the note? His truths, legacy, philosophy, or principles for that matter, that left an indelible mark on our history.\nToday, I want to share my review on Gandhi’s biography, “The Story Of My Experiments With Truth”. There are 5 parts in his book, and I will go over all the key learnings from the Mahatma himself.\nPart 1 - Early Life Gandhi was born in Porbandar to a devout Hindu family. His father, Karam Chand was an esteemed minister and his mother, Putlibai, a religious and an intelligent woman. It was from his mother Gandhi reveals, that shaped his spiritual beliefs in the years to come. He was married at the age of thirteen, a child marriage commonplace during the time that weighed heavily on his conscience. a bitter truth he remorsely conveys that cast a shadow on his understanding of personal freedom.\nThroughout the chapters of Part 1, Gandhi confesses his shy nature and the ingenious ways he overcame it. He was an introvert finding delight in books. While I was eagerly flipping through the pages, it was abundantly clear to me that Gandhi was exceptionally well-read. He devoured knowledge across diverse subjects. Religion, Vegetarianism, Philosophy, you name it. In the truest sense, he was honest unlike any other. It takes an honest man some grit to reveal to his readers his shortcomings. Our man does that throughout these pages. Starting with an incident in his school days, where he was (wait for it) accused of lying! He had skipped a gymnastics class to be a nurse to his sick father. He states that it was the last careless incident of his school days, however, not of his childhood days though.\nThere are moments in young Gandhi’s life filled with his share of regrets: first, of an incident where he secretly stole coppers from his servant’s pocket money to smoke cigarettes. Another of any ill-formed friendship; a friend whom his mother, elder brother and wife warned to stay away from. He reveals that the reason for being friends with his elder brother’s classmate was to “reform him”. Alas, his intent did not go as planned. Instead he was influenced by him to be a meat-eater. He conveys his regret on taking this path briefly, although I felt maybe it would make him physically stronger while fighting against the British later (hehe just kidding!).\nAfter his father’s demise, and completing of his matriculation, he was presented with an opportunity to study in England. It struck me that it was only a century ago when Gandhi set his sight on England, and his caste people were agitated for him moving abroad, entitling him as an outcast. This serves as a reminder of the fluid nature of societal perception. it is just a matter of time, like they say, for the perspective to evolve. So off goes the outcast, leaving his wife and his first born: To England.\nIn England at last, Gandhi shares his brief encounters with the cultural differences, immersing himself in studying law, learning how to be “an English Gentleman”, and exploring vegetarianism. a narrative that unfolded delightfully. One key thing in this part of the book that caught my intrigue was Gandhi’s habit of accounting. He tracked his expenses precisely and succeeded in exercising it with large amounts as well. This is one thing I feel we lack in the consumeristic culture we live in today.\nAlso, for my readers who work a corporate job, here is something that may or may not apply to you. The following lesson was given to Gandhi by a Mr. Mehta, verbatim the first lesson on European etiquette –\n‘Do not talk loudly, never address people “sir” whilst speaking to them, as we do in India; only servants and subordinates address theirs masters that way.’ In the context of working in a corporate job, it’s just bad practise to do that. if you are a fresh graduate, it should take you a while, but what I find madly preposterous is people with a work experience exceeding a culinary hen still address their senior management people as ‘sir\" even though they have asked them NOT to! (I can recall three instances as I write this when a senior manager asked people not to call him sir!)\nIt’s a mystery to me on what they achieve from the disrespect they give their senior management. If a person demands to be called sir, that’s another story. You can ruffle their feathers nonetheless. Why? Because calling someone sir* is awkward, and outdated to say the least. However, I digress.\n* on circumstance of a corporate job. the usage on other places is debatable, yet I feel it polite only when you do not know a person’s name for instance. (totally avoidable though!)\nPart 2 - Experience in Africa In the annals of history, Gandhi’s encounter with racism in South Africa remains a poignant chapter. In this section of the book, he shares his experience at length about being ejected out of his first-class passenger seat, his battle against color prejudice and racism, his Christian contacts whose support helped him deeply in his quest for finding God and spiritual enlightenment.\nTo acquire true knowledge, Gandhi says, one must have a guru. a mentor to mold one’s progress and self-growth. A result of which yields a moral standing and strength. He pays tribute to Raychandbhai, who taught him the importance of self-discipline and truthfulness to Gopal Krishna Gokhale’s influence that shaped his political activism. Additionally, he speaks of other notable figures namely Leo Tolstoy, whose prose had influenced his view of the world profoundly.\nSpeaking of, I think finding the right Guru is a challenge. While one may lack the knowledge in a particular field, another would be too occupied to fulfill their own responsibilities. I think of it as a good thing though. In today’s digital age, there is a wealth of information you can acquire on the internet. The goal should be in this long walk, a constant strive for self-improvement.\nAnother thing to note is that Gandhi’s prose is deeply personal. If you delve into his work, it is close to impossible to not be affected by it. I must say, our hero was without a question an imperfect man. Despite all of this, his truths continue to resonate within us, a testament to his enduring power of prose.\nHis influence is far-fetched akin to the arms of a bapu, literally. In Africa, He unites all the Indians under a sole cause: Fair Treatment. It was indeed the rise of Mahatma Gandhi, not just as a political leader, but the voice for the voiceless. A public service barrister. In his own words, and I quote, “To find the better side of human nature, a lawyer must unite parties, river asunder.”\nPart 3 - His Philosophy Gandhi’s self-reliant nature is possibly what I admire most about the man. His ability to perform tasks like washing his own clothes or cutting his own hair. It came at the cost of ridicule, yet his determination was unhindered.\nWhile he stayed with Gokhale, he learns of the dedication required to do public service, and how his hectic schedule restrained him from taking long walks or exercise. He thus emphasizes the reader to prioritize one’s health and well-being. This one I liked too.\nHowever, there are some aspects of his philosophy that I find unnecessary. For instance, he believes, vows don’t close the door to freedom but open them. And caring for children is inconsistent (more on this later) with doing public work, which again is quite the contrary.\nWhen faced with adversity, Gandhi doesn’t succumb. He recounts a tough moment when his son, Manilal fell ill, and the doctor prescribed eggs and chicken broth, which is contrary to Gandhi’s vegetarianism principles. This situation truly tested his conviction. Nevertheless, Gandhi perseveres and sticks to his values, and cares for his son, leaving no stone unturned.\nI beleive in a balanced diet. In fact I encourage cooked green vegetables as an essential in your meal. I say this, for Gandhi advocates self-control in every aspect, including diet. According to him, control of the palate – simple, spiceless, and uncooked foods – to restrain the senses and passions of life. I disagree with this perspective for the most part. It reminds me of a quote from one of my favorite authors of the 19th century.\n“The only way to get rid of a temptation is to yield to it. Resist it, and your soul grows sick with longing for the things it has forbidden to itself, with desire for what its monstrous laws have made monstrous and unlawful.”\nI find some of these teachings for the modern life challenging, and I daresay unrealistic for everyone. Everyone. for a great man like Gandhi, it’s a breeze.\nAnother aspect of Gandhi’s principle I can appreciate and encourage though, is his emphasis on cleanliness and sanitation. Despite his efforts on hygiene on third-class passenger trains or places of the divine, the reality even today is far from ideal. He proposes solutions, yet the unsanitary habits we have accustomed ourselves with is disheartening. It is nothing, but a lost cause. From my experience nothing much has changed.\nPart 4 \u0026 5 – soon.\nQuote of the month I have nothing new to teach the world, Truth and non-violence are as old as the hills. "},"title":"The Story Of My Experiments With Truth"},"/blog/jawan/":{"data":{"":"last thursday, i went to watch the socio-political action thriller, “Jawan”.\nthere were two compelling reasons i couldn’t afford to miss this film: first, my unwavering admiration for the superstar Shah Rukh Khan, and second, my curiosity about the unique mummified look that had been teased.\napart from this, there was the film’s antagonist played by our very own Makkal Selvan, whose outstanding portrayal of “Michael Vedanayagam” in the web series Farzi had left a lasting impression on me. his performance was a delightful blend of ruthlessness, humor, and sheer entertainment in the show. it was evident that he brought the same brutality in jawan. lastly, of course, Nayanthara and Deepika, whose brief appearance had a significant impact in the story.\ntalking of the story – i knew since the moment i stepped in, it would have Atlee’s trademark style – a dramatic narrative with a strong social message and a hallmark of masala films – when the hero is in danger, call the hero himself to save the day.\nwhat is memorable about jawan though, is the opening sequence. Atlee skillfully packages the stardom of SRK, and lets us have a seat for the grand and dramatic face reveal. a few glimpses doesn’t cut it, oh no, it has to be extravagant. is it realistic, heck no, but was it exciting and undeniably cool, HELL YEAH! it was one of those moments you cannot get your eyes out of. it leaves you spellbound even though you know what’s coming.\nspeaking of SRK, he is the villianous, bald, mysterious vigilante. he is also a super cool jawan, with a moustache to die for. and in the second half with slick action sequences in his wolverine-like appearance, it was nothing short of paisa wasool entertainment.\nanother reason not to miss this film is Anirudh’s music. he delivers cinematic bangers at this point. while the songs were mediocre at best, the background score packs a punch.\nif you like indian films or not, one thing is for sure though, this film would make your heart go maasi, maasi, maasi, maasi, maasi, maasi, maasi .."},"title":"jawan - a review"},"/blog/mpv-scripts/":{"data":{"#":"in this blog, i will share a list of no-nonense scripts for mpv.\nif you are not using mpv, and using something else – here are few reasons why you must consider it:\nlightweight customizable with scripting support relatively easy to setup and use faster than vlc Scripts1. mpv chapters1 Display chapters and allow you to jump to them with a mouse click. as easy as saving the file in your scripts/ folder. press TAB to display the chapters. https://github.com/zxhzxhz/mpv-chapters\n2. mpv thumbnails script2 Display preview thumbnails when hovering over the seekbar.\nhttps://github.com/marzzzello/mpv_thumbnail_script\nSetup copy the 2 scripts from the releases page and place them in your config file: $HOME/.config/mpv/scripts/ set ‘osc=no’ or un-comment the link in your mpv.conf file in the path $HOME/.config/mpv/mpv.conf If you want to take a look at other user scripts, you can view them here\nhttps://github.com/zxhzxhz/mpv-chapters ↩︎\nhttps://github.com/marzzzello/mpv_thumbnail_script ↩︎","scripts#Scripts":""},"title":"mpv scripts"},"/blog/solving-captchas/":{"data":{"#":"\nsolving captcha programatically is a pain. me and this other dude at work took about two weeks to solve version 2 of google recaptcha which we learned later, was an enterprise versioned captcha. i did not understand what that meant, until i read between the lines of the docs.\nthis blog is a simple sidenote on how to solve recaptcha (v2) with 2captcha API. you can read the docs, which btw, is amazing.\nprequisities 2captcha API key install requests step 1 right click around the captcha area –\u003e inspect element\nstep 2 find the “data-sitekey” parameter and copy the value. this will be the ‘googlekey’ value.\nstep 3 send a http GET request to submit a captcha.\nimport requests #pip install requests API_KEY = '1abc234de56fab7c89012d3' URL = 'http://2captcha.com/in.php' SITE = 'https://site-with-captcha.com' response = requests.get(URL, params = { 'key': API_KEY, 'method': 'userrecaptcha', 'googlekey': 'key-from-step2', 'pageurl' : SITE }) step 4 if you came this far, you will get the ID of your captcha as plain text, like:\nOK|2122988149 if you get an error message, do not proceed to the next step. refer the documentation if you get any errors.\nstep 5 make a 15-20 seconds timeout and then, submit another GET request:\nURL = 'http://2captcha.com/res.php' response = requests.get(URL, params = { 'key':API_KEY, 'action': get, 'id': 2122988149 }) if captcha is already solved, server will respond with a randomly generated token. if it does not, you can repeat your request in 5 seconds.\nstep 6 in developer’s console, find the textarea with id=“g-recaptcha-response”, and send the received code.\ni used selenium to send the code back like so:\ndriver.execute_script(\"\"\" document.getElementById( \"g-recaptcha-response\" ).innerText='2122988149'; \"\"\") Then you can submit the captcha response, and recaptcha will be solved.\nNote: there is a high possibility these steps won’t work. if you are looking for a direct method, you can find it here","prequisities#prequisities":""},"title":"solving captchas"},"/braindump/":{"data":{"":"all my braindumps are listed here.\n02-10-2023 — Activate Virtual Environments in Powershell 11-09-2023 — setting up proxies (IP authentication) with Selenium and Python "},"title":"Braindump"},"/braindump/proxy-auth/":{"data":{"":"","#":"this is a sample configuration of using proxies with IP authentication, using selenium and python.\nsample code CHROMEDRIVER_PATH = /path/to/chromedriver PROXY = \"23.23.23.23:3128\" # IP:PORT URL = 'https://example.com' from seleniumwire import webdriver from selenium.webdriver.chrome.options import Options from selenium.webdriver.chrome.service import Service options = Options() options.add_argument('--proxy-server=%s' % PROXY) s = Service(CHROMEDRIVER_PATH) driver = webdriver.Chrome(service=s, options=options) driver.get(URL) what if the connection is insecure? install this certificate\nor get the certificate using: python -m seleniumwire extractcert after the certificate is installed,\nopen chrome settings select “Privacy and Security” under “Advanced” setting, click “Manage device certificates” then, click “Trusted Root Certification Authority” -\u003e “import” import the certificate you just have downloaded. this will make the connection secure."},"title":"setting up proxies in selenium"},"/braindump/venv/":{"data":{"":"","#":"I love the simplicity of Linux and Bash. Probably why I prefer it over the unneccesary complexities of powershell. Nonetheless I am using it to familiarize myself with the commands.\nI was using Git Bash that ships with git for Windows, until I discovered the power of Windows Terminal1, an exceptional terminal emulator that enhanced my “Windows experience.”\nI like the seamless integration between different shells and its customizability, in contrast to the uninspiring blue powershell.\nI have a fair share of issues with powershell. One of them was to active a python virtual environment.\nSimple fix Set-ExecutionPolicy -Scope CurrentUser -ExecutionPolicy Unrestricted https://github.com/microsoft/terminal ↩︎"},"title":"Activate Virtual Environments in Powershell"},"/contact/":{"data":{"":" Click on the icons below to contact me!\ncontact me using ‘unchaineddev’ on the platform https://jami.net"},"title":"Contact"},"/explore/":{"data":{"":" Braindump My Personal Library Resources Music "},"title":"Categories"},"/library/":{"data":{"":"","fiction#Fiction":"","non-fiction#Non-Fiction":"","philosophy#Philosophy":"","plays#Plays":"","poetry#Poetry":"This page contains a list of books from my personal library. While I don’t consider myself to be a book hoarder, I do have a reasonable number to display them here.\nif you have any questions or want to recommend or review any book, you can do that here\nthe books are categorized by genre, and each genre is arranged chronologically based on the author’s name.\nFiction Adiga, Arvind – The White Tiger Alcott, Louisa May – Little Women Archer, Jeffrey – A Prisoner of Birth Austen, Jane – Pride and Prejudice Bond, Ruskin – The Blue Umbrella Bond, Ruskin – The Girl on the Train Brontë, Charlotte – Jane Eyre Brontë, Emily – Wuthering heights Chattopadhyay, Sarat Chandra – Datta (Betrothed) Chattopadhyay, Sarat Chandra – Ramer Shumoti (Ram’s Wise Mind) Christie, Agatha – The Murder on the Links Christie, Agatha – The Mysterious Affair at Styles Christie, Agatha – Where the light lasts Coelho, Paulo – Adultery Coelho, Paulo – The Devil and Miss Prym Coelho, Paulo – The Spy Coelho, Paulo – Veronica Decides to Die Conrad, Joseph – Heart of Darkness Dickens, Charles – A Christmas Carol Dostoyevsky, Fyodor – Crime and Punishment Doyle, Arthur Conan – The Complete Novels of Sherlock Holmes Doyle, Aruthur Conan – The Hound of the Baskervilles Fitzgerald, Scott F. – The Great Gatsby Flynn, Gillian – Gone Girl Flynn, Gillian – The Grownup Forster, E.M – A Passage to India Ghosh, Amitav – The Shadow Lines Hemingway, Ernest – The Old Man and the Sea Henry, O – Best of O’Henry Hosseini, Khaled – A Thousand Splendid Suns Jerome, Jerome K. – Three Men in a Boat Kafka, Franz – Metamorphosis Kafka, Franz – The Trial King, Stephen – The Shining King, Stephen – IT Kipling, Rudyard – The Jungle Book Lee, Harper – To Kill a Mockingbird Manto, Saadat Hasan – Selected Short Stories (Aatish Taseer) Morrison, Toni – Beloved Murakami, Haruki – Birthday Girl Murakami, Haruki – Kafka on the Shore Murthy, Sudha – Three Thousand Stitches Nabokov, Vladimir – Lance Orwell, George – 1984 Orwell, George - Animal Farm Poe, Edgar Allan – Selected Tales Plath, Sylvia – The Bell Jar Puzo, Mario – The Godfather Ray, Satyajit – Sonar Kella (The Golden Fortress) Ray, Satyajit – Chhinnamastar Abhishap (The Curse of the Goddess) Roy, Arundhathi – The God of Small Things Salinger, J.D – Catcher in the Rye Shelly, Mary – Frankenstein Singh, Khushwant – Train to Pakistan Smith, Zadie - White Teeth Stoker, Bram – Dracula Tagore, Rabindranath - Nashtanirh (Broken Nest) Twain, Mark – The Adventures of Huckleberry Finn Twain, Mark – The Adventures of Tom Sawyer Wells, H.G – The Time Machine Wharton, Edith – The Age of Innocence Wilde, Oscar – The Picture of Dorian Grey Non-Fiction Achebe, Chinua – Africa’s Tarnished Name Albom, Mitch – Tuesdays with Morrie Allen, James – As a Man Thinketh Ambedkar, B.R – Ambedkar’s India Brandt, Charles – I Heard You Paint Houses Benyamin – Goat Days Dickens, Charles – Night Walks Durrani, Tehmina – My Feudal Lord Frank, Anne – The Diary of a Young Girl Gandhi, Mahatma – The Story of my Experiments with Truth Grover, Ashneer – Doglapan: The Hard Truth about Life and Start-ups Marx, Karl – The Communist Manifesto Mukherjea, Saurabh / Ranjan, Rakshit / Uniyal, Pranab - Coffee Can Investing Singh, Khushwant – The End of India Tagore, Rabindranath – Nationalism Tzu, Sun – The Art of War Philosophy Aristotle - Poetics Camus, Albert – The Myth of Sisyphus Nietzsche, Friedrich Wilhelm – Thus Spake Zarathustra Seneca - Letters from a Stoic Plays Christie, Agatha – The Mousetrap \u0026 Selected Plays Miller, Arthur – Death of a Salesman Shakespeare, William – Julius Caesar Shakespeare, William – Macbeth Shakespeare, William – Othello Shakespeare, William – The Comedy of Errors Wilde, Oscar – The Importance of Being Earnest Poetry Brontë, Emily – The Night is Darkening Round Me Hafez – The Nightingales are drunk Gibran, Kahlil – The Prophet Keats, John – The Eve of St.Agnes Shakespeare, William – Sonnets Whitman, Walt – On the Beach at Night Alone "},"title":"My Personal Library"},"/music/":{"data":{"":"","#":"This is a compiled list of my absolute favorites. Whether you’re craving something fresh, or downright extraordinary, my playlist has got you covered.\nLife is for the living. Death is for the dead. Let life be like music. And death a note unsaid.\nSounds of Silence – If I mention S\u0026G, most draw a blank face with an intrigue to know more. The moment I quote, “Hello darkness, my old friend..” it’s like a lightbulb moment – everyone gets it.\nMe Against The World – What sets 2Pac apart from others is that he carries an unmatched resonance. His music is deeply personal, poetic and lyrical.\nBlood On The Tracks – My man is at his rawest best. Whether it is Tangled up in Blue, or “Idiot Wind”, It’s refreshing each time you listen to this album.\nThe Marshall Mathers LP – A lyrical genius. I won’t be suprised if people have listened to this entire album without realizing it."},"title":"My Favorite Music"}}